app/controllers/games_controller.rb

  def index
    @games = Game.all.order(:title)
---
SELECT "games".* FROM "games" ORDER BY "games"."title" ASC

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("image", "title", "description", "genre", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @game.update(game_params)
        format.html { redirect_to @game, notice: "Game was successfully updated." }
        format.json { render :show, status: :ok, location: @game }

        @games = Game.all.order(:title)
---
UPDATE "games" SET "price" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["price", 249.0], ["updated_at", "2021-11-23 15:39:54.264819"], ["id", 12]]
SELECT "games".* FROM "games" ORDER BY "games"."title" ASC

  def who_bought
    @game = Game.find(params[:id])
    @latest_order = @game.orders.order(:updated_at).last
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" INNER JOIN "line_items" ON "orders"."id" = "line_items"."order_id" WHERE "line_items"."game_id" = ? ORDER BY "orders"."updated_at" DESC LIMIT ?  [["game_id", 12], ["LIMIT", 1]]