app/controllers/line_items_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-11-12 15:33:13.130481"], ["updated_at", "2021-11-12 15:33:13.130481"]]
INSERT INTO "line_items" ("game_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["game_id", 12], ["cart_id", 1], ["created_at", "2021-11-12 15:33:13.450400"], ["updated_at", "2021-11-12 15:33:13.450400"]]
UPDATE "line_items" SET "updated_at" = ?, "count" = ? WHERE "line_items"."id" = ?  [["updated_at", "2021-11-12 16:00:28.195779"], ["count", 4], ["id", 14]]
---
  def create
    game = Game.find(params[:game_id])
    @line_item = @cart.add_game(game)

    respond_to do |format|
      if @line_item.save