app/controllers/orders_controller.rb

SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 36], ["LIMIT", 1]]
---
    def ensure_cart_isnt_empty
      if @cart.line_items.empty?