app/controllers/store_controller.rb

  def index
    @games = Game.order(:title);
---
SELECT "games".* FROM "games" ORDER BY "games"."title" ASC