app/views/line_items/_line_item.text.erb

<%= sprintf("%2d x %s", line_item.count, truncate(line_item.game.title, length: 50)) %>
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]